// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('прошу ввести число');
// if (x !== 0 ){
//     console.log('вірно')
// } else {
//     console.log('не вірно')
// }
// console.log(x)


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
// попадає число
// (в першу, другу, третю или четверту частину години).

// let time = +prompt('прошу ввести число від 0 до 59');
// console.log(time);
//
// if (time < 0 || time > 59) {
//     console.log('введено неправильне число');
// } else if (time >= 0 && time <= 15) {
//     console.log('1 чверть');
// } else if (time >= 16 && time <= 30) {
//     console.log('2 чверть');
// } else if (time >= 31 && time <=45) {
//     console.log('3 чверть');
// } else if (time >= 46 && time <= 59) {
//     console.log('4 чверть');
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('прошу ввести дату від 1 до 31');
// console.log(day);
// if (day < 1 || day > 31) {
//     console.log('дата введена неправильно')
// } else if (day >= 1 && day <= 10) {
//     console.log('1 декада');
// } else if (day >= 11 && day <= 20) {
//     console.log('2 декада');
// } else if (day >= 21 && day <= 31) {
//     console.log('3 декада');
// }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і
// на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
// let week = +prompt('прошу порядковий день тижня');
// console.log(week);
// switch (week) {
//     case 1:
//         console.log('піти на роботу');
//         break;
//
//     case 2:
//         console.log('купити продукти');
//         break;
//
//     case 3:
//         console.log('вигуляти собаку');
//         break;
//
//     case 4:
//         console.log('заправити машину');
//         break;
//
//     case 5:
//         console.log('забрати дитину зі школи');
//         break;
//
//     case 6:
//         console.log('зробити ремонт');
//         break;
//
//     case 7:
//         console.log('зробити дз з js');
//         break;
//
//     default:
//         console.log('потрібно ввести число від 1 до 7')
// }



//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let num1 =+prompt('прошу ввести 1 число');
// let num2 = +prompt('прошу ввести 2 число');
// console.log(num1, num2);
//
// if (num1 > num2) {
//     console.log(`максимальне число = ${num1}`)
// } else if (num2 > num1) {
//     console.log(`максимальне число = ${num2}`)
// } else if (num1 === num2) {
//     console.log('числа рівні')
// }


//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х
//         являється falsy (хибноподыбне, тобто кастується до false)

 //let x = prompt('необхідно ввести будь яке значення')
// // if (x !== true) {
//     if (x === 0 || x === false || x === '' || isNaN(x) || x === undefined) {
//         x = 'default'
//     }
//
//     console.log(x)

//варіант показували на практичному
let y = NaN || 'default'
console.log(y)

//додаткові

// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ['Ivan', 'Slavik', 'Grisha', 'Lera', 'Ira']
// if (friends.length >= 3 ) {
//     console.log('це великий масив');
// } else {
//     console.log('цей масив маленький')
// }


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1 = + prompt( 'потрібно ввести 1 число');
// let num2 = + prompt( 'потрібно ввести 2 число');
// let num3 = + prompt( 'потрібно ввести 3 число');
//
// if (num1 > num2 && num1 < num3)  {
//              console.log(`середнє число =${num1}`)
// } else if (num1 < num2 && num1 > num3)  {
//              console.log(`середнє число =${num1}`)
// } else if (num2 > num1 && num2 < num3) {
//     console.log(`середнє число =${num2}`)
// } else if (num2 < num1 && num2 > num3) {
//     console.log(`середнє число =${num2}`)
// }  else if (num3 > num1 && num3 < num2) {
//     console.log(`середнє число =${num3}`)
// } else if (num3 < num1 && num3 > num2) {
//     console.log(`середнє число =${num3}`)
// } else if (num1 === num2 || num1 === num3 || num2 === num3) {
//     console.log('неможливо визначити середнє число')
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let a = +prompt('введіть число a');
// let b = +prompt('введіть число b');
//
// let result = (a + b < 4) ? 'Мало' : 'Багато';
// console.log(result)

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число:
// позитивним, негативним або нулем
// напишіть це тернарним оператором

// let num = +prompt('прошу ввести число від -100 до 100');
//
// let number = num > 0 ? 'число позитивне' : num < 0 ? 'число негативне' : 'число = 0'
// console.log(number)


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false.
//     Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let a = confirm('do some');
// // let test = a ? 'Вірно' : 'Неправильно';
// // console.log(test);
//
// if (a === true) {
//     console.log('вірно')
// } else if (a !== true) {
//     console.log('Неправильно')
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let question = prompt('Яка «офіційна» назва JavaScript?')
// if (question === 'ECMAScript') {
//     console.log('Правильно!');
// } else {
//     console.log('Не знаєте? ECMAScript!')
// }


//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let flat = +prompt('введіть номер квартири від 1 до 90');
// if (flat >= 1 && flat <= 20){
//     console.log("квартира знаходиться в 1 під'їзді");
// } else if (flat >= 21 && flat <= 48){
//     console.log("квартира знаходиться в 2 під'їзді");
// } else if (flat >= 49 && flat <= 90){
//     console.log("квартира знаходиться в 3 під'їзді");
// } else {
//     console.log('такої квартири в будику немає')
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести
// повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('прошу ввести число');
// number === 10 ? console.log('вірно') : console.log('не вірно')



// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let temperature = +prompt('введіть температуру');
// if (temperature >= 10 && temperature <=22) {
//     console.log('ми йдемо вчитися');
// } else
//     console.log('сидимо вдома і вчимося ОНЛАЙН')




// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді
//     вивести Повідомлення - що число не вірне ...

// let game = +prompt('введіть число від 1 до 5')
// switch (game) {
//     case 1:
//         console.log('Ви виграли автомобіль');
//         break;
//
//     case 2:
//         console.log('Ви виграли телефон');
//         break;
//
//     case 3:
//         console.log('Ви виграли холодильник');
//         break;
//
//     case 4:
//         console.log('Ви виграли піцу');
//         break;
//
//     case 5:
//         console.log('Ви виграли квартиру');
//         break;
//
//     default:
//         console.log('Ви нічого не виграли');
// }
