// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('прошу ввести число');
// if (x !== 0 ){
//     console.log('вірно')
// } else {
//     console.log('не вірно')
// }
// console.log(x)


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
// попадає число
// (в першу, другу, третю или четверту частину години).

// let time = +prompt('прошу ввести число від 0 до 59');
// console.log(time);
//
// if (time < 0 || time > 59) {
//     console.log('введено неправильне число');
// } else if (time >= 0 && time <= 15) {
//     console.log('1 чверть');
// } else if (time >= 16 && time <= 30) {
//     console.log('2 чверть');
// } else if (time >= 31 && time <=45) {
//     console.log('3 чверть');
// } else if (time >= 46 && time <= 59) {
//     console.log('4 чверть');
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('прошу ввести дату від 1 до 31');
// console.log(day);
// if (day < 1 || day > 31) {
//     console.log('дата введена неправильно')
// } else if (day >= 1 && day <= 10) {
//     console.log('1 декада');
// } else if (day >= 11 && day <= 20) {
//     console.log('2 декада');
// } else if (day >= 21 && day <= 31) {
//     console.log('3 декада');
// }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і
// на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
// let week = +prompt('прошу порядковий день тижня');
// console.log(week);
// switch (week) {
//     case 1:
//         console.log('піти на роботу');
//         break;
//
//     case 2:
//         console.log('купити продукти');
//         break;
//
//     case 3:
//         console.log('вигуляти собаку');
//         break;
//
//     case 4:
//         console.log('заправити машину');
//         break;
//
//     case 5:
//         console.log('забрати дитину зі школи');
//         break;
//
//     case 6:
//         console.log('зробити ремонт');
//         break;
//
//     case 7:
//         console.log('зробити дз з js');
//         break;
//
//     default:
//         console.log('потрібно ввести число від 1 до 7')
// }



//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let num1 =+prompt('прошу ввести 1 число');
// let num2 = +prompt('прошу ввести 2 число');
// console.log(num1, num2);
//
// if (num1 > num2) {
//     console.log(`максимальне число = ${num1}`)
// } else if (num2 > num1) {
//     console.log(`максимальне число = ${num2}`)
// } else if (num1 === num2) {
//     console.log('числа рівні')
// }


//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х
//         являється falsy (хибноподыбне, тобто кастується до false)

let x = prompt('необхідно ввести будь яке значення')
if (!x || x !== true) {
    x = 'default'
}
    console.log(x)
